HalloYang06/PSOC_E84_robot/applications/ifx_deepcraft/include/ifx_sp_utils_priv.h
int spectrogram_calculate_spctrg_component_size();

/***********************************************************************
* Function: mel_features_fix_init(void* dPt, int persistent_count)
*
* Purpose:  This function initialize fixed-point feature extraction
*
*
* Input:   dPt               - is the data container structure pointer
*          persistent_count  - is persistent memory start size
*
* Outputs: NA
*
* Return: void
*
***********************************************************************/
void mel_features_fix_init(void* dPt, int persistent_count);

/***********************************************************************
* Function: mel_features_fix_compute(spectrogram_top_struct* topdPt, const int16_t* audio_data, int16_t* features)
*
* Purpose:  This function serves as fixed-point feature extraction
*
*
* Input:   topdPt       - is the data container structure pointer
*          audio_data   - is the 16-bit audio sample buffer
*
* Outputs: features     - is the 8-bit or 16-bit fixed-point feature ouput and Q = MFCC_Q or MEL_LOG_Q
*          out_q        - is the output fixed-point Q value pointer
*
* Return: true  - Algorithm completed.
*         false - Algorithm exist ealier.
*
***********************************************************************/
bool mel_features_fix_compute(spectrogram_top_struct* topdPt, const IFX_SP_DATA_TYPE_T* audio_data, IFX_FE_DATA_TYPE_T* features, int32_t* out_q);

/***********************************************************************
* Function: spectrogram_calculate_persistent_mem_size(uint16_t mel_sample_rate, uint16_t mel_block_size, uint16_t mel_num_fbank_bins, uint16_t mel_num_mfcc_coeffs)
*
* Purpose:  This function calculate persistent memory size needed for
*           fixed-point feature extraction
*
*
* Input:   mel_sample_rate     - is the sampling rate
*          mel_block_size      - is FFT block size
*          mel_num_fbank_bins  - is the number of mel filter bank bins
*          mel_num_mfcc_coeffs - is the number of MFCC coefficeints, set to 0 for LOG MEL.
*
* Outputs: NA
*
* Return: persistent memory size
*
***********************************************************************/
int spectrogram_calculate_persistent_mem_size(uint16_t mel_sample_rate, uint16_t mel_block_size, uint16_t mel_num_fbank_bins, uint16_t mel_num_mfcc_coeffs);

/***********************************************************************
* Function: spectrogram_calculate_scratch_mem_size(uint16_t mel_block_size, uint16_t mel_num_fbank_bins)
*
* Purpose:  This function calculate scratch memory size needed for
*           fixed-point feature extraction
*
*
* Input:   mel_block_size  - is FFT block size
*          mel_num_fbank_bins  - is the number of mel filter bank bins
*
* Outputs: NA
*
* Return: scratch memory size
*
***********************************************************************/
int spectrogram_calculate_scratch_mem_size(uint16_t mel_block_size, uint16_t mel_num_fbank_bins);

/***************************************************************************************
* Function: afe_hpf_calculate_persistent_mem_size(void)
*
* Purpose:  This function calculate persistent memory size needed for afe hpf
*
****************************************************************************************/
int afe_hpf_calculate_persistent_mem_size();

/***************************************************************************************
* Function: ifx_afe_hpf_init(void* afeHpfTopPt)
*
* Purpose:  This function init afe hpf process
*
****************************************************************************************/
int32_t ifx_afe_hpf_init(void* afeHpfTopPt);

/***************************************************************************************
* Function: ifx_afe_hpf(void* afeHpfTopPt, int16_t* inbuf1, int16_t* inbuf2, int16_t* outbuf1, int16_t* outbuf2)
*
* Purpose:  This function run frame by frame afe hpf process
*
****************************************************************************************/
void ifx_afe_hpf(void* afeHpfTopPt, int16_t* inbuf1, int16_t* inbuf2, int16_t* outbuf1, int16_t* outbuf2);

/***************************************************************************************
* Function: asrc_lpf_calculate_persistent_mem_size(void)
*
* Purpose:  This function calculate persistent memory size needed for afe hpf
*
****************************************************************************************/
int asrc_lpf_calculate_persistent_mem_size();

/***************************************************************************************
* Function: ifx_asrc_lpf_init(void* asrcLpfTopPt)
*
* Purpose:  This function init afe hpf process
*
****************************************************************************************/
int32_t ifx_asrc_lpf_init(void* asrcLpfTopPt);

/***************************************************************************************
* Function: ifx_asrc_lpf_reset(void* lpf_container)
*
* Purpose:  This function init afe hpf process
*
****************************************************************************************/
uint32_t ifx_asrc_lpf_reset(void* lpf_container);

/***************************************************************************************
* Function: ifx_asrc_lpf(void* asrcLpfTopPt, int16_t* inbuf1, int16_t* inbuf2, int16_t* outbuf1, int16_t* outbuf2)
*
* Purpose:  This function run frame by frame afe hpf process
*
****************************************************************************************/
void ifx_asrc_lpf(void* asrcLpfTopPt, int16_t* inbuf1, int16_t* inbuf2, int16_t* outbuf1, int16_t* outbuf2);


/***************************************************************************************
* Function: itsi_feature_process_calculate_scratch_mem_size(void)
*
* Purpose:  This function calculate scratch memory size needed for itsi feature
*
****************************************************************************************/
int itsi_feature_process_calculate_scratch_mem_size(void);

/***************************************************************************************
* Function: itsi_feature_process_calculate_persistent_mem_size(void)
*
* Purpose:  This function calculate persistent memory size needed for itsi feature
*
****************************************************************************************/
int itsi_feature_process_calculate_persistent_mem_size(void);

/***************************************************************************************
* Function: dfww_calculate_persistent_mem_size(void)
*
* Purpose:  This function calculate persistent memory size needed for dfww detection
*
****************************************************************************************/
uint32_t dfww_calculate_persistent_mem_size(void);

/***************************************************************************************
* Function: dfww_calculate_scratch_mem_size(void)
*
* Purpose:  This function calculate scratch memory size needed for dfww detection
*
****************************************************************************************/
uint32_t dfww_calculate_scratch_mem_size(void);

/***************************************************************************************
* Function: dfcmd_calculate_persistent_mem_size(void)
*
* Purpose:  This function calculate persistent memory size needed for dfcmd detection
*
****************************************************************************************/
uint32_t dfcmd_calculate_persistent_mem_size(void);

/***************************************************************************************
* Function: dfcmd_calculate_scratch_mem_size(void)
*
* Purpose:  This function calculate scratch memory size needed for dfcmd detection
*
****************************************************************************************/
uint32_t dfcmd_calculate_scratch_mem_size(void);

/***************************************************************************************
* Function: agc_calculate_scratch_mem_size(void)
*
* Purpose:  This function calculate scratch memory size needed for post process AGC
*
****************************************************************************************/
uint32_t agc_calculate_scratch_mem_size(void);

/***************************************************************************************
* Function: agc_calculate_persistent_mem_size(void)
*
* Purpose:  This function calculate persistent memory size needed for post process AGC
*
****************************************************************************************/
uint32_t agc_calculate_persistent_mem_size(void);

/***************************************************************************************
* Function: ifx_agc_init(void* agc_container, int16_t *agcParms)
*
* Purpose:  This function initialize post process AGC
*
****************************************************************************************/
uint32_t ifx_agc_init(void* agc_container, int16_t *agcParms);

/***************************************************************************************
* Function: ifx_agc_reset(void* agc_container)
*
* Purpose:  This function reset state in post process AGC
*
****************************************************************************************/
uint32_t ifx_agc_reset(void* agc_container);

/***************************************************************************************
* Function: ifx_agc(void* agc_container, int16_t* inbuf, int16_t* outbuf)
*
* Purpose:  This is post process AGC function
*
****************************************************************************************/
uint32_t ifx_agc(void* agc_container, int16_t* inbuf, int16_t* outbuf);

/***************************************************************************************
* Function: speech_utils_itsi_get_parm(void* container, int32_t ip_id, float* parm)
*
* Purpose:  This function get parameter coresponding to itsi component ID from its container
*
****************************************************************************************/
uint32_t speech_utils_itsi_get_parm(void* container, int32_t ip_id, float* parm);

/***************************************************************************************
* Function: speech_utils_itsi_set_parm(void* container, int32_t ip_id, float parm)
*
* Purpose:  This function set parameter coresponding to itsi component ID from its container
*
****************************************************************************************/
uint32_t speech_utils_itsi_set_parm(void* container, int32_t ip_id, float parm);

#if defined(__cplusplus)
}
#endif

#endif /*__IFX_SP_UTILS_PRIV_H */

/* [] END OF FILE */